Revit 2027 API
ParameterTypeId.SteelElemPatternEdgeDistanceX Property
 "Edge distance on side 1"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemPatternEdgeDistanceX { get; }
Public Shared ReadOnly Property SteelElemPatternEdgeDistanceX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemPatternEdgeDistanceX {
	ForgeTypeId^ get ();
}
static member SteelElemPatternEdgeDistanceX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace